/* Задача 2:
Да предположим, че един часовник показва 12 часа. Да се направи програма, която въвежда от клавиатурата 
естествено число n (не по-голямо от 10000) и извежда на екрана броя на пълните завъртания на малката стрелка 
на часовника за n часа и кое число ще сочи малката стрелка след n часа.*/

#include <iostream>

int main(){
    int h=12, n;
    std::cin>> n;
    if (n>=0 && n<=10000) {
        n%=12;
        h = (12 + n);
    }
    else {
            std::cout<<"Error";
        }
    std::cout<<h;
    return 0;
}
