/*Задача 3:
В едно училище направили кръгли градинки, в които красиво подредили цветя. За съжаление, все се намирали недобросъвестни ученици, които 
влизали в градинките и тъпчели цветята. Ето защо, от ръководството на училището решили да оградят градинките с телена мрежа. Училищният 
градинар, който точно знаел радиусите на всички градинки, трябвало да изчисли колко дълга мрежа е необходима за ограждането на всяка една 
от тях. Той не бил много силен по математика, а и не можел да смята бързо. Помогнете на градинаря, като напишете програма, която въвежда от 
клавиатурата радиуса на една градинка (дробно число) и извежда на екрана дължината на мрежата, която трябва да се закупи, за да се огради 
градинката. */

#include <iostream>
//#include <math.h>
//#define _USE_MATH_DEFINES
#define M_PI           3.14159265358979323846  /* pi */


int main(){
    double r, c;
    std::cin>> r;
    c = 2*M_PI*r;
    std::cout<<"You need: " << c; 
}
