/*Задача 4:
Дадено е цяло трицифрено число k. Да се състави програма, която прочита от клавиатурата числото k и извежда на екрана сумата от цифрите му.*/

#include <iostream>

int main(){
    int k, n;
    std::cin>> k;
    if (k >=100 && k <= 999){
        n = /*k/100 + (k/10)%10 +*/ (k/10)%100;
        std::cout<< n;
    }
    else {
        std::cout<<"Error";
    }
    return 0;
}
