/* Задача 5: Налага се да се боядиса правоъгълна стена с дължина l и височина h. Известно е, че с една кутия боя могат да се боядисат a квадратни единици 
от площта на стената. Напишете програма, която прочита от клавиатурата дробните числа l, h и а, и извежда на екрана колко кутии боя са необходими, 
за да се боядиса стената.*/

#include <iostream>

int main() {
    int l, h, a, boxes;
    std::cin >> l >> h >> a;
    if (l > 0 && h > 0 && a > 0) {
        int space = l*h;
        boxes = space / a;
        std::cout << boxes << std::endl;
    }
    else 
        std::cout<< "Enter valid numbers!"<< std::endl ;
    return 0;
}
