//Задача 1:
//Да се състави програма, която прочита от клавиатурата цяло трицифрено число k и извежда на екрана обърнатото 
//му число - това, което се получава при подреждане на цифрите на k в обратен ред.

#include <iostream>

int main() {
    int n, m;
    std::cin >> n;
    m = ((n/100)%10) + ((n/10)%10)*10 + (n%10)*100;
    std::cout << m;
}
